0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1.414;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    blades
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    shaft
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    struts
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    walls
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    top
    {
        type            fixedValue;
        value           $internalField;
    }

    bottom
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    AMI1
    {
        type  		cyclicAMI;
        value   	$internalField;
    }

    AMI2
    {
        type  		cyclicAMI;
        value   	$internalField;
    }

    "proc.*"
    {
        type            processor;
    }

}


// ************************************************************************* //
