system/funkyDoCalcDict.2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeAveragePressureGradient
{
    type swakExpression;
    outputControlMode timeStep;
    outputInterval 1;
    valueType surface;
    surfaceName testPlane;
    surface {
        type plane;
        basePoint (1.0 0.0 0.0);
        normalVector (1 0 0);
        interpolate true;
    };
    verbose true;
    expression "-gradPMeanX/UMean.x";
    accumulations (weightedAverage);
}

planeAverageUx
{
    type swakExpression;
    outputControlMode timeStep;
    outputInterval 1;
    valueType surface;
    surfaceName testPlane;
    verbose true;
    expression "UMean.x";
    accumulations (weightedAverage);
}

// ************************************************************************* //
