system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver           	GAMG;
        tolerance        	0.01; // Was 0.02
        relTol           	0; // Was 0
        smoother         	GaussSeidel; // Was GaussSeidel
        nPreSweeps       	0; // Was 0
        nPostSweeps      	2; // 2
        cacheAgglomeration 	true; // Was on
        agglomerator     	faceAreaPair;
        nCellsInCoarsestLevel 	50; // Was 10
        mergeLevels      	1;
    }

    p
    {
        $pcorr;
        tolerance       1e-6; // 1e-6
        relTol          0.01; // Was 0.01
    }

    pFinal
    {
        $p;
        tolerance       1e-6; // 1e-6
        relTol          0; // Was 0
    }

    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|k|omega)Final"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
    }

}

PIMPLE
{
    correctPhi          no;
    nOuterCorrectors    20; // Was 2, set higher for more PIMPLE loops
    nCorrectors         3; // Was 1
    nNonOrthogonalCorrectors 1; // Was 0
    pRefCell        1001;
    pRefValue       0;

    residualControl
    {
        U
        {
            tolerance 1e-2;
            relTol 0;
        }

        p
        {
            tolerance 1e-2;
            relTol 0;
        }
    }
}

relaxationFactors
{
    fields
    {
        p               0.7; // 0.3;
    }
    equations
    {
        "(U|k|omega)"      0.8; // 0.7;
        "(U|k|omega)Final" 1.0; // 1.0;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
