system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

surfaces
{
    type            surfaces;
    functionObjectLibs ("libsampling.so");
    outputControl   outputTime;

    surfaceFormat   vtk;
    fields          (p U Q magVorticity);

    interpolationScheme cellPoint;

    surfaces
    (
        isoQ
        {
            type            isoSurface;
            isoField        Q;
            isoValue        1000;
            interpolate     true;
        }

        isoVorticity
        {
            type            isoSurface;
            isoField        magVorticity;
            isoValue        6;
            interpolate     true;
        }

        turbine
        {
            type            patch;
            patches         (blades shaft struts);
            interpolate     true;
        }
    );
}


// ************************************************************************* //
